spec/vcr_cassettes/HelcimRuby_Resources_Payments/_purchase/with_card_token/processes_a_purchase_with_different_amount.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.helcim.com/v2/payment/purchase
    body:
      encoding: UTF-8
      string: '{"amount":18.19,"currency":"USD","ipAddress":"127.0.0.1","ecommerce":true,"cardData":{"cardToken":"cdeed21583e976f9ef4843"},"customerCode":"CST1146"}'
    headers:
      Api-Token:
      - "<API_TOKEN>"
      Accept:
      - application/json
      Content-Type:
      - application/json
      Idempotency-Key:
      - d678d23c-e9cd-4378-a265-f
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 11 Apr 2025 17:21:11 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Access-Control-Allow-Headers:
      - Origin, Content-Type, X-Auth-Token, js-token
      Access-Control-Allow-Methods:
      - GET, POST, PUT, PATCH, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Origin, Content-Type, X-Auth-Token, js-token
      Access-Control-Max-Age:
      - '600'
      Hour-Limit-Remaining:
      - '3000'
      Minute-Limit-Remaining:
      - '99'
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Cf-Cache-Status:
      - DYNAMIC
      Set-Cookie:
      - __cf_bm=qY5pvO5KbumEQEDN1EISraQAQGsN5XQU4FOaXWOwIBM-1744392071-1.0.1.1-_GrfeSfwZBF0NDGajqS5l.YM0G3ZdCMcpsVdj66ujWZxaQpnZeLaTDnjivfP4x3b0nvfI3y6wYpSeRw.8Bnb.OBBQiNIanFHigjj2vIBOLUBF3FNg9R8lc6R.yP3ixrG;
        path=/; expires=Fri, 11-Apr-25 17:51:11 GMT; domain=.helcim.com; HttpOnly;
        Secure; SameSite=None
      Server:
      - cloudflare
      Cf-Ray:
      - 92ec28a3883c7cdf-LAX
      Alt-Svc:
      - h3=":443"; ma=86400
    body:
      encoding: ASCII-8BIT
      string: '{"transactionId":33888443,"dateCreated":"2025-04-11 11:21:10","cardBatchId":4662020,"status":"APPROVED","user":"Helcim
        System","type":"purchase","amount":18.19,"currency":"USD","avsResponse":"X","cvvResponse":"","cardType":"VI","approvalCode":"T1E9ST","cardToken":"cdeed21583e976f9ef4843","cardNumber":"4124939990","cardHolderName":"John
        Doe","customerCode":"CST1146","invoiceNumber":"INV001126","warning":""}'
  recorded_at: Fri, 11 Apr 2025 17:21:11 GMT
recorded_with: VCR 6.3.1
